microchip-pic-avr-examples/pic32ak1216gc41064-gpdim-demo/pic32ak1216gc41064-gpdim.X/bsp/led_green.c
/*
© [2024] Microchip Technology Inc. and its subsidiaries.

    Subject to your compliance with these terms, you may use Microchip 
    software and any derivatives exclusively with Microchip products. 
    You are responsible for complying with 3rd party license terms  
    applicable to your use of 3rd party software (including open source  
    software) that may accompany Microchip software. SOFTWARE IS ?AS IS.? 
    NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS 
    SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT,  
    MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT 
    WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY 
    KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF 
    MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE 
    FORESEEABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP?S 
    TOTAL LIABILITY ON ALL CLAIMS RELATED TO THE SOFTWARE WILL NOT 
    EXCEED AMOUNT OF FEES, IF ANY, YOU PAID DIRECTLY TO MICROCHIP FOR 
    THIS SOFTWARE.
*/

#include <xc.h>
#include "led_green.h"
#include "../../src/config/default/peripheral/ccp/plib_sccp2.h"

static bool issccp2Enabled = false;

void LED_GREEN_Initialize(void)
{
    SCCP2_CompareInitialize();
    SCCP2_Compare16bitPeriodValueSet(0xFFFF); // Set the period for the PWM
    SCCP2_Compare16bitValueSet(0x0000);       // Set initial duty cycle
}

void LED_GREEN_On(void)
{
    SCCP2_CompareStart();
    issccp2Enabled = true;
}

void LED_GREEN_Off(void)
{
    SCCP2_CompareStop();
    issccp2Enabled = false;
}

void LED_GREEN_Toggle(void)
{
    if (issccp2Enabled == true) 
    {
        LED_GREEN_Off();
    } 
    else 
    {
        LED_GREEN_On();
    }
}

void LED_GREEN_Set(bool on)
{
    
}

void LED_GREEN_SetIntensity(uint16_t request)
{  
    SCCP2_Compare16bitValueSet(request);
} 

const struct LED_DIMMABLE ledGreen = 
{
    &LED_GREEN_Initialize,
    &LED_GREEN_On,
    &LED_GREEN_Off,
    &LED_GREEN_Toggle,
    &LED_GREEN_Set,
    &LED_GREEN_SetIntensity
};